In [1]:
import pandas as pd

In [2]:
clientes = pd.read_excel('/content/clientes.xlsx')
clientes.head()

                          Nome  Fone Principal  ...       CEP     CPF ou CNPJ
0               Alberto Amaral  (00) 0000-0000  ...  72025065  998.971.301-44
1          Anderson  Magalhaes  (00) 0000-0000  ...  72035503  994.763.391-87
2                Rafaela Alves  (00) 0000-0000  ...  71925000  992.776.701-34
3              Daniela Coimbra  (00) 0000-0000  ...  72151502  978.660.245-53
4  Sheyla Walescá Alves Dantas  (00) 0000-0000  ...  71937360  914.914.605-04

[5 rows x 12 columns]

In [3]:
clientes.columns

Index(['Nome', 'Fone Principal', 'Celular', 'Endereço', 'Num.', 'E-mail',
       'Qtd. Pedidos', 'Bairro', 'Cidade', 'Código', 'CEP', 'CPF ou CNPJ'],
      dtype='object')

In [5]:
clientes.drop(columns=['Fone Principal', 'Celular', 'Endereço', 'E-mail', 'Bairro', 'Cidade', 'CEP', 'CPF ou CNPJ'], inplace=True)
clientes.head()

                          Nome  Num.  Qtd. Pedidos  Código
0               Alberto Amaral    13             2     567
1          Anderson  Magalhaes  4530             1     778
2                Rafaela Alves   713             1     661
3              Daniela Coimbra     0             1     852
4  Sheyla Walescá Alves Dantas     8             2     600

In [6]:
clientes.describe()

       Qtd. Pedidos      Código
count    909.000000  909.000000
mean       3.976898  458.075908
std        9.192060  263.740156
min        0.000000    3.000000
25%        1.000000  230.000000
50%        1.000000  457.000000
75%        4.000000  687.000000
max      118.000000  914.000000

In [18]:
clientes_duplicados = clientes['Nome'].value_counts() >= 2 
clientes_duplicados

Augusto                         True
Thaline Saraiva IFOOD           True
Renato Kennedy                  True
Nathália Maracajá               True
Caroline Monte                  True
                               ...
Diogo marido Alba              False
José Inácio                    False
Kamilly Vitória Matoso lima    False
Marcelo Brito IFOOD            False
Tainara Abrante bonfim         False
Name: Nome, Length: 880, dtype: bool

In [30]:
print(clientes_duplicados[clientes_duplicados])
print(clientes_duplicados[clientes_duplicados].count())

Augusto                              True
Thaline Saraiva IFOOD                True
Renato Kennedy                       True
Nathália Maracajá                    True
Caroline Monte                       True
nasser clayton bernardino e silva    True
Eliane Moraes                        True
Geovanna Neri                        True
Natane Teles                         True
Natane Teles IFOOD                   True
Gustavo Lacerda                      True
Gabriela Vieira Rocha                True
Catarina Lopes                       True
Rodolpho Costa                       True
Rebeca Mendes                        True
Giovanna                             True
Adriano Faria IFOOD                  True
Gabriel                              True
João Victor                          True
Danielle                             True
Daniel Rangel                        True
Ana Carolina                         True
Ana Luiza                            True
Fernanda Oliveira                    True
Maria Clara                          True
Cleide Reis                          True
Gabriela Cardoso                     True
Márcio Lopes                         True
Gabriela Sousa                       True
Name: Nome, dtype: bool
29

In [35]:
clientes_drop_duplicados = clientes.drop_duplicates(subset=['Nome'])
clientes_drop_duplicados

                                Nome       Num.  Qtd. Pedidos  Código
0                     Alberto Amaral         13             2     567
1                Anderson  Magalhaes       4530             1     778
2                      Rafaela Alves        713             1     661
3                    Daniela Coimbra          0             1     852
4        Sheyla Walescá Alves Dantas          8             2     600
..                               ...        ...           ...     ...
904                   Alba Gonçalves          4            19     343
905                  Agatha Giovanna   alt 1108             4     481
906  Adriane Da Silva de Albuquerque         08             1     877
907             Adriana Kely França   Apto 1903            10     450
908                    Abner Pereira         09             7     710

[880 rows x 4 columns]

In [70]:
# Agora limpando o DataFrame de pedidos
pedidos = pd.read_excel('/content/pedidos.xlsx')
pedidos.head()

   Cód. Pedido               Cliente  ...           Status Abrir
0         4125             Thaynara   ...  Finalizado/Pago   NaN
1         4124        Eduarda Mendes  ...  Finalizado/Pago   NaN
2         4123         Abner Pereira  ...  Finalizado/Pago   NaN
3         4122  Adriana Kely França   ...  Finalizado/Pago   NaN
4         4121        Arthur Eduardo  ...  Finalizado/Pago   NaN

[5 rows x 12 columns]

In [71]:
pedidos.columns

Index(['Cód. Pedido', 'Cliente', 'Colaborador ', 'Tipo', 'Aberto Em',
       'Finalizado Em', 'Forma Pagamento', '+ Serviço', '+ Entrega',
       '= Total a Receber', 'Status', 'Abrir'],
      dtype='object')

In [72]:
pedidos.drop(columns=['Cód. Pedido', 'Colaborador ', 'Tipo', 'Finalizado Em', 'Forma Pagamento', '+ Serviço', '+ Entrega',
       '= Total a Receber', 'Status', 'Abrir'], inplace=True)
pedidos.head()

                Cliente               Aberto Em
0             Thaynara  2020-10-04 22:54:16.990
1        Eduarda Mendes 2020-10-04 22:17:49.753
2         Abner Pereira 2020-10-04 22:05:43.447
3  Adriana Kely França  2020-10-04 21:42:58.360
4        Arthur Eduardo 2020-10-04 21:25:42.868

In [73]:
pedidos.rename(columns={'Cliente': 'Nome'}, inplace=True)
pedidos.head()

                   Nome               Aberto Em
0             Thaynara  2020-10-04 22:54:16.990
1        Eduarda Mendes 2020-10-04 22:17:49.753
2         Abner Pereira 2020-10-04 22:05:43.447
3  Adriana Kely França  2020-10-04 21:42:58.360
4        Arthur Eduardo 2020-10-04 21:25:42.868

In [74]:
pedidos.describe()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  """Entry point for launching an IPython kernel.

                          Nome                   Aberto Em
count                     3627                        3627
unique                     866                        3627
top     Andre Augusto, o lindo  2020-03-26 22:07:47.884000
freq                       118                           1
first                      NaN  2020-01-04 19:36:36.561000
last                       NaN  2020-10-04 22:54:16.990000

In [76]:
pedidos_duplicados = pedidos['Nome'].value_counts() >= 2
pedidos_duplicados

Andre Augusto, o lindo                 True
LUCIAN FERRAZ DE ARAUJO BONIFACIO      True
Victor Bonifácio                       True
Jefferson patriota deep web            True
Heber Bonifácio                        True
                                      ...
Guiguizão Rei                         False
Mayara IFOOD                          False
Gustavo Henrique                      False
Arthur Gedeão Boaventura Gonçalves    False
ANDRÉ MATA OLIVEIRA                   False
Name: Nome, Length: 866, dtype: bool

In [77]:
print(pedidos_duplicados[pedidos_duplicados].count())
print(pedidos_duplicados[pedidos_duplicados])

448
Andre Augusto, o lindo               True
LUCIAN FERRAZ DE ARAUJO BONIFACIO    True
Victor Bonifácio                     True
Jefferson patriota deep web          True
Heber Bonifácio                      True
                                     ...
Bruna Gabriela Pereira Barreiros     True
Gabriel                              True
Denise Machado                       True
Dalilla da Silva Saraiva             True
Alberto dos Santos Meira             True
Name: Nome, Length: 448, dtype: bool

In [79]:
pedidos_drop_duplicados = pedidos.drop_duplicates(subset=['Nome'])
pedidos_drop_duplicados

                            Nome               Aberto Em
0                      Thaynara  2020-10-04 22:54:16.990
1                 Eduarda Mendes 2020-10-04 22:17:49.753
2                  Abner Pereira 2020-10-04 22:05:43.447
3           Adriana Kely França  2020-10-04 21:42:58.360
4                 Arthur Eduardo 2020-10-04 21:25:42.868
...                          ...                     ...
3565              Paula Spinello 2020-01-11 21:47:11.710
3566  ISMAEL CARLOS LOPES DUARTE 2020-01-11 20:50:22.213
3598                    Gessyane 2020-01-08 21:16:30.395
3611                 Deise ASTAK 2020-01-07 20:22:18.982
3612                Daiane ASTAK 2020-01-07 20:21:01.183

[866 rows x 2 columns]

In [80]:
# Nessa tabela de pedidos ainda tenho que separar somente os clientes dos últimos 3 meses.

pedidosUltimosTresMeses = pedidos_drop_duplicados[pedidos_drop_duplicados['Aberto Em'] >= '2020-07-01']
pedidosUltimosTresMeses

                                       Nome               Aberto Em
0                                 Thaynara  2020-10-04 22:54:16.990
1                            Eduarda Mendes 2020-10-04 22:17:49.753
2                             Abner Pereira 2020-10-04 22:05:43.447
3                      Adriana Kely França  2020-10-04 21:42:58.360
4                            Arthur Eduardo 2020-10-04 21:25:42.868
...                                     ...                     ...
1500                           ANA VIRGINIA 2020-07-01 22:26:36.863
1501                          Carolina melo 2020-07-01 22:15:34.795
1503                               Monaliza 2020-07-01 21:39:20.699
1504                     Ferdinando Furlani 2020-07-01 21:30:34.385
1515  Danielle Martins dos Santos Doralice  2020-07-01 18:52:22.039

[521 rows x 2 columns]

In [81]:
juntandoTudo = pd.concat([pedidosUltimosTresMeses, clientes_drop_duplicados]) 
juntandoTudo

                                Nome  ... Código
0                          Thaynara   ...    NaN
1                     Eduarda Mendes  ...    NaN
2                      Abner Pereira  ...    NaN
3               Adriana Kely França   ...    NaN
4                     Arthur Eduardo  ...    NaN
..                               ...  ...    ...
904                   Alba Gonçalves  ...  343.0
905                  Agatha Giovanna  ...  481.0
906  Adriane Da Silva de Albuquerque  ...  877.0
907             Adriana Kely França   ...  450.0
908                    Abner Pereira  ...  710.0

[1401 rows x 5 columns]

In [87]:
juntandoTudo.describe()

       Qtd. Pedidos      Código
count    880.000000  880.000000
mean       3.937500  456.721591
std        9.276658  264.844194
min        0.000000    3.000000
25%        1.000000  227.750000
50%        1.000000  454.500000
75%        4.000000  686.250000
max      118.000000  914.000000

In [92]:
teste = juntandoTudo['Nome'].value_counts() >= 2
teste

JEAN PAULO BRIDI                    True
Jonathan  Lucena                    True
Mara Silva                          True
Ludmilla oliveira ferreira          True
Anderson                            True
                                   ...
Brayan                             False
Cassiano Moreira Da Silva IFOOD    False
Hélcio José                        False
Jéssica Lorrane                    False
Viviane Pirolo                     False
Name: Nome, Length: 880, dtype: bool

In [93]:
teste[teste]

JEAN PAULO BRIDI                True
Jonathan  Lucena                True
Mara Silva                      True
Ludmilla oliveira ferreira      True
Anderson                        True
                                ...
Peter Gabriel                   True
BRUNO FERREIRA                  True
Paulo Henrique                  True
Júlio César Soares de Souza     True
CAMYLA MILANEZ                  True
Name: Nome, Length: 521, dtype: bool

In [86]:
# Removendo duplicados e, teoricamente, minha tabela final.
clientesAnterioresTresMeses = juntandoTudo.drop_duplicates(subset='Nome', keep=False)
clientesAnterioresTresMeses

                                Nome Aberto Em  Num.  Qtd. Pedidos  Código
28        Valnice Gonçalves da Silva       NaT    31           1.0   584.0
35                      Luís Azevedo       NaT   322           1.0   582.0
46                   Marley Ferreira       NaT    27           1.0   562.0
81   Daniel dos Anjos Gomes da Silva       NaT    13           1.0   565.0
86    Paulo César Moreira Leal Filho       NaT    10           1.0   578.0
..                               ...       ...   ...           ...     ...
843          Carlos Eduardo Marques        NaT   406           0.0   568.0
848                    Brutal Burger       NaT    20           0.0   522.0
860                          Brayan        NaT    46           1.0   573.0
878              Angelita Brito Sena       NaT  1803           1.0   590.0
899                            Aline       NaT    11           1.0   575.0

[359 rows x 5 columns]

In [94]:
clientesAnterioresTresMeses.to_csv('clientesAnterioresTresMeses')